// Задача 3
#include <stdio.h>
#include <math.h>
#include <locale.h> // Указание библиоте
int main() {
	setlocale(LC_ALL, "Rus");
	char *day[] {"Десять", "Одиннадцать", "Двенадцать", "Тринадцать", "Четырнадцать", "Пятнадцать",
	 "Шестнадцать", "Семнадцать", "Восемнадцать", "Девятнадцать", "Двадцать",
	 "Двадцать одно", "Двадцать два", "Двадцать три", "Двадцать четыре", "Двадцать пять", 
	 "Двадцать шесть", "Двадцать семь", "Двадцать восемь", "Двадцать девять", "Тридцать", 
	 "Тридцать одно", "Тридцать два", "Тридцать три", "Тридцать четыре", "Тридцать пять", 
	 "Тридцать шесть", "Тридцать семь", "Тридцать восемь", "Тридцать девять", "Сорок" }; // Создание массива
	 int d; // Указание типа данных переменной 
	 scanf("%d", &d);
	 if ((d == 10) || (d == 11) || (d == 12) || (d == 13) || (d == 14) || (d == 15) || (d == 16) || (d == 17) || (d == 18) || (d == 19) || (d == 20) || (d == 25) || (d == 26) || (d == 27) || (d == 28) || (d == 29) || (d == 30) || (d == 35) || (d == 36) || (d == 37) || (d == 38) || (d == 39) || (d == 40))
	 {
	 	printf ("%s учебных заданий", day[d - 10]);	
	 }
	 if ((d == 21) || (d == 31))
	 {
	 	printf("%s учебное задание", day[d - 10]); 
	 }
	 if ((d == 22) || (d == 23) || (d == 24) || (d == 32) || (d == 33) || (d == 34))
	 {
	 	printf("%s учебных задания", day[d - 10]); // Вывод результата, в зависимости от выполнения условий
	 }
	 return 0;
}
