// Задача 4
#include <stdio.h>
#include <math.h>
#include <locale.h> // Указание библиотек
int main() {
	setlocale(LC_ALL, "Rus");
	int N, a, b, c, d; // Указание типа данных переменных
	char *a1[] {"Сто", "Двести", "Триста", "Четыреста", "Пятьсот", "Шестьсот", "Семьсот", "Восемьсот", "Девятьсот"};
	char *b1[] {"десять", "двадцать", "Тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
	char *c1[] {"один", "два", "три", "четыре", "пять", "шесть", "семь", "восьмь", "девять"};
	char *d1[] {"одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"}; // Ввод массивов
	scanf("%d", &N);// Ввод значения переменной пользователем 
	a = N / 100;
	d = N % 100;
	b = d / 10;
	c = d % 10;// Нахождение цифр числа
	printf("%s ", a1[a - 1]); // Вывод разряда сотен
	if ((d == 11) || (d == 12) || (d == 13) || (d == 14) || (d == 15) || (d == 16) || (d == 17) || (d == 18) || (d == 19))
	{
		printf("%s ", d1[d - 11]); // Вывод разряда десятков и единиц в пределе от 11 - 19
	}
	else 
	{
		if (b != 0)
		{
			printf("%s ", b1[b - 1]); // Вывод разряда десятков
		}
		if (c != 0)
		{
	
			printf("%s ", c1[c- 1]); // Вывод разряда единиц
		}
	}
	return 0;
}
